[
        {
            "artist": "Autopsy",
            "album": "Severed Survival",
            "year": 1989,
            "country": "United States",
            "genre": ["Death Doom Metal","Death Metal"],
            "trivia": "Autopsy is one of the pioneers of death metal (and death doom metal in particular), and their debut 'Severed Survival' has always been my favorite of their albums. 'Mental Funeral' has certainly grown on me, but Severed Survival is excellent from cover to over. I've always loved how prominent the bass guitar is in this album. It's what got me hooked on it in the first place. A lot of the time, the bass isn't so audible. I think hearing it so clearly here really enhances the music.",
            "cover": "https://ia803100.us.archive.org/24/items/mbid-559645f2-6f41-4cf4-9b94-461c39e1c6d9/mbid-559645f2-6f41-4cf4-9b94-461c39e1c6d9-7240968812_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Blood Incantation",
            "album": "Hidden History of the Human Race",
            "year": 2019,
            "country": "United States",
            "genre": "Death Metal",
            "trivia": "Blood Incantation has steadily creeped their way up my list of favorite bands, and this is my favorite album of theirs. It's full of awesome guitar riffs and excellent songwriting, and it scratches that weird/cosmic death metal itch that so few bands do (Demilich and Timeghoul being the forefathers of this style). I definitely have more to say but it's 11:43 PM so I need to hurry up and finish writing the rest of these.",
            "cover": "https://ia601001.us.archive.org/14/items/mbid-d9008bfc-8cc1-4dab-b18d-129e904cf0a9/mbid-d9008bfc-8cc1-4dab-b18d-129e904cf0a9-27849840604_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Cavalera",
            "album": "Bestial Devastation",
            "year": 2023,
            "country": "United States",
            "genre": ["Death Metal", "Thrash Metal"],
            "trivia": "The re-recorded version of one of my favorite Sepultura releases. Everything on 'Bestial Devastation' is great.",
            "cover": "https://ia600301.us.archive.org/18/items/mbid-0dbda5d8-02b4-46cc-ad39-693e839ae18d/mbid-0dbda5d8-02b4-46cc-ad39-693e839ae18d-35673432907_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Celtic Frost",
            "album": "To Mega Therion",
            "year": 1985,
            "country": "Switzerland",
            "genre": "Thrash Metal",
            "trivia": "For 1985, this album kicks serious ass. Celtic Frost is undoubtedly one of the most influential metal bands of all time, being a major inspiration for the coming wave of black metal and death metal that swept across the globe in the mid 80s to early 90s. When I first heard 'To Mega Therion,' I wasn't really into it, but I could never stay away from an album with such a cool cover. 'Dawn of Meggido' was probably the song that kept me coming back (whereas the others took quite a while to grow on me). I liked 'Dawn of Meggido' for its booming drums and gloomy atmosphere, but over time I've come to really appreciate the ferocity of this album and the power in Tom G. Warrior's vocals. These days I would say my favorite track is either 'The Usurper' or 'Jewel Throne.' This is 100% one of my favorite albums.",
            "cover": "https://ia802907.us.archive.org/31/items/mbid-e1d4cd4a-6336-3066-87ca-519e803b47a8/mbid-e1d4cd4a-6336-3066-87ca-519e803b47a8-3614349157_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Current 93",
            "album": "Swastikas for Noddy",
            "year": 1988,
            "country": "United Kingdom",
            "genre": "Neofolk",
            "trivia": "In my eyes, 'Swastikas for Noddy' is a great proof of concept for what the English neofolk scene was capable of back in its heyday. David Tibet's vocals are manic and excellent, and Douglas Pearce, Rose McDowell, Boyd Rice, John Balance, Steven Stapleton, etc. all make valuable contributions.",
            "cover": "https://ia801904.us.archive.org/31/items/mbid-f944a8c9-6e08-411b-9d27-9f6dce0b3ccd/mbid-f944a8c9-6e08-411b-9d27-9f6dce0b3ccd-3600088222_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Current 93",
            "album": "All the Pretty Little Horses / The Inmost Light",
            "year": 1996,
            "country": "United Kingdom",
            "genre": "Neofolk",
            "trivia": "Easily one of Current 93's best albums, 'All the Pretty Little Horses' is packed with beautiful folk arrangements and masterfully crafted dark ambience. Threatening and beautiful at the same time.",
            "cover": "https://ia801502.us.archive.org/17/items/mbid-5438dc3b-0dec-3cfc-974c-eb5e1f387eed/mbid-5438dc3b-0dec-3cfc-974c-eb5e1f387eed-3611031754_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Demigod",
            "album": "Slumber of Sullen Eyes",
            "year": 1992,
            "country": "Finland",
            "genre": "Death Metal",
            "trivia": "This was the album that got me back into metal after a 6 month break from it entirely. Yet another album I didn't care for at first, the second time I put this on, I was immediately hooked on it. Fast, groovy, and forceful, 'Slumber of Sullen Eyes' is an undisputed classic from the Finnish scene and death metal as a whole.",
            "cover": "https://ia804508.us.archive.org/25/items/mbid-4d1ccfc4-9971-4c8e-87a1-6113fff74def/mbid-4d1ccfc4-9971-4c8e-87a1-6113fff74def-30343683303_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Demilich",
            "album": "20th Adversary of Emptiness",
            "year": 2014,
            "country": "Finland",
            "genre": "Death Metal",
            "trivia": "This is a compilation of everything ever recorded by Demilich (which isn't a lot of material to be quite honest), but of course the centerpiece is their classic 1993 album 'Nespithe.' 'Nespithe' is certainly one of the more bizarre death metal albums out there, but its winding, unconvential riffs and otherworldy vocals make it a must listen. I was put off by the vocals at first; they do sound like burping, but it's still impressive--few people can do vocals quite like Antti Boman can. At this point I think they're pretty cool.",
            "cover": "https://ia801206.us.archive.org/17/items/mbid-025f11c4-08b6-4f99-a151-18c8422944f1/mbid-025f11c4-08b6-4f99-a151-18c8422944f1-10908816475_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "FesterDecay",
            "album": "Carcasses Revenge",
            "year": 2017,
            "country": "Japan",
            "genre": "Goregrind",
            "trivia": "While shopping at a record store in Bellingham, I came across a treasure trove of goregrind CDs/tapes. I wouldn't say goregrind is one of my 'main' genres or anything, but according to the store owner, the artist who makes the album covers for some of these goregrind releases lives here in Bellingham and recently dropped off a huge box of this stuff at the store. So I've taken it upon myself to collect all these releases for fun. This CD and the goregrind CDs that follow are a part of that effort. As for the actual CD, it's solid. There were a couple tracks I liked, although overall I wasn't blown away or anything. But I listened to a full length album from this band (for the first time) while putting this website together, and I have to say, it was pretty damn good. So I'll be looking forward to adding another CD from this band to my collection, and I'll be anticipating whatever material they release next.",
            "cover": "",
            "spine": ""
        },
        {
            "artist": "Globularcyst",
            "album": "Fermented Abscess Proliferation",
            "year": 2020,
            "country": "China",
            "genre": "Goregrind",
            "trivia": "I haven't listened to this album yet, but the cover looks pretty cool.",
            "cover": "",
            "spine": ""
        },
        {
            "artist": "Incantation",
            "album": "Onward to Golgotha",
            "year": 1992,
            "country": "United States",
            "genre": ["Death Metal", "Death Doom Metal"],
            "trivia": "Definitely not my favorite Incantation album, but it would be odd to not have this in a death metal collection as it's an old school classic. I bought this along with CDs from Demigod, Suffocation, Pestilence, and I think a couple others after going down a list of essential death metal releases on my phone in a record store, so that's why I own it. I prefer 'Mortal Throne of Nazarene' by a solid margin, though. I really would like to get that one on CD at some point.",
            "cover": "https://ia802800.us.archive.org/12/items/mbid-b0ec8e17-413c-435a-a45c-f8ad606c6a7f/mbid-b0ec8e17-413c-435a-a45c-f8ad606c6a7f-20819786418_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Judas Priest",
            "album": "Painkiller",
            "year": 1990,
            "country": "United Kingdom",
            "genre": "Heavy Metal",
            "trivia": "This isn't something I would have originally checked out, but I suppose you can only go so far as a metalhead without having to check out Judas Priest. I haven't really gotten into anything else from their discography; a lot of what I've heard is a bit too slow and 'rock n roll' for my taste. But 'Painkiller' is considered one of Priest's fastest and most aggressive releases (as well as one of their best in general), and I fell in love with it as soon as I heard the title track.",
            "cover": "https://ia801204.us.archive.org/26/items/mbid-1c562534-8e15-4645-8b3f-8a2efd4aeee3/mbid-1c562534-8e15-4645-8b3f-8a2efd4aeee3-11873855022_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Necrony",
            "album": "Severe Malignant Pustule",
            "year": 1991,
            "country": "Sweden",
            "genre": ["Goregrind","Deathgrind"],
            "trivia": "I picked this one up because the prospect of a goregrind album coming straight from the Swedish death metal scene at is peak was really interesting to me. When I think of the 90s Swedish scene I imagine bands like Entombed, Dismember, Gorement, etc. Goregrind doesn't really come to mind at all. I listened to this one with a friend. It was decent--didn't really blow my mind or anything. I honestly think it sounds way more like standard death metal than goregrind. I'm not sure why other people consider it goregrind.",
            "cover": "",
            "spine": ""
        },
        {
            "artist": "Necrot",
            "album": "Lifeless Birth",
            "year": 2024,
            "country": "United States",
            "genre": "Death Metal",
            "trivia": "I bought this in preparation for seeing Necrot on tour with the Cavalera brothers. I prefer to be already familiar with a band before I see them live, if possible. I still need to spend more time with this album, but it has a couple songs I quite like, and the band was awesome live.",
            "cover": "https://ia801304.us.archive.org/24/items/mbid-fd9a269a-5e0b-4905-94d9-cb48cccfbfb6/mbid-fd9a269a-5e0b-4905-94d9-cb48cccfbfb6-37970964708_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": ["Oozing", "Pharmacist"],
            "album": "Forbidden Exhumation / Thanatological Reflections on Necroticism ",
            "year": 2020,
            "country": ["Japan","United States"],
            "genre": ["Goregrind","Deathgrind","Death Metal"],
            "trivia": "I haven't listened to this yet, but I picked it up cause it was another Pharmacist release. People seem to like Pharmacist (and now that I've heard his other album, I am one of those people), so I decided it was a safe investment at the time.",
            "cover": "",
            "spine": ""
        },
        {
            "artist": "Pharmacist",
            "album": "Medical Renditions of Grinding Decomposition",
            "year": 2020,
            "country": "Japan",
            "genre": "Goregrind",
            "trivia": "I need to spend more time with this album, too, but it's really solid Carcass worship. I like 'Gastronomic Spoiled Courage.'",
            "cover": "",
            "spine": ""
        },
        {
            "artist": "Putrefaction Sets In",
            "album": "Repugnant Inception of Decomposing Paroxysm ",
            "year": 2022,
            "country": ["Brazil","Sweden","United States"],
            "genre": "Goregrind",
            "trivia": "I haven't listened to this one yet either, but I got it because I thought the cover art looked cool and I thought that having members from Brazil, Sweden, and the US (all known for their extreme metal scenes, of course) was really interesting.",
            "cover": "https://ia802306.us.archive.org/27/items/mbid-b9ca1e22-7b7b-4fbe-9870-72d59cfccdc3/mbid-b9ca1e22-7b7b-4fbe-9870-72d59cfccdc3-32310463894_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Queens of the Stone Age",
            "album": "Songs for the Deaf",
            "year": 2002,
            "country": "United States",
            "genre": "Rock",
            "trivia": "Out of all the albums listed here, I've known about this one for the longest. I discovered this back when I was still trying to go through the 4chan music wiki's '/mu/core chart,' and I got pretty into it and then dropped it for a couple years. I recently heard 'Go With the Flow' on an Instagram video and that motivated me to re-visit it. It happened to be *way* better than I remembered, and I've been obsessed with it. An all around excellent alt rock/stoner rock album. Immaculate vibes.",
            "cover": "https://ia803106.us.archive.org/6/items/mbid-2622f72c-73ae-4a8c-b533-c1d995d260e8/mbid-2622f72c-73ae-4a8c-b533-c1d995d260e8-30995859727_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Rippikoulu",
            "album": "Musta seremonia",
            "year": 1993,
            "country": "Finland",
            "genre": ["Death Doom Metal","Death Metal"],
            "trivia": "I didn't care for this at first, but I've seen the error in my ways and spent some quality time with this demo. This is some fantastic death doom metal--some of the heaviest I've heard. My favorite track is 'Kuolematon totuus.'",
            "cover": "https://dn721904.ca.archive.org/0/items/mbid-1fd3635e-85a5-468d-839c-b6f0ba92be95/mbid-1fd3635e-85a5-468d-839c-b6f0ba92be95-27618400640_thumb250.jpg",
            "spine": ""
        },
        {
            "artist": "Swans",
            "album": "Soundtracks for the Blind",
            "year": 1996,
            "country": "United States",
            "genre": "Post-rock",
            "trivia": "Swans is likely my favorite band of all time, and 'Soundtracks for the Blind' probably isn't my #1 favorite Swans album, it's *very* close. Soundtracks is pretty renowned among online music communities and for good reason. This 2.5 hour monster is some of Swans' best material. It's dense, hypnotic, and utterly electric.",
            "cover": "https://dn721801.ca.archive.org/0/items/mbid-cc525d5e-b4a5-40c7-9aa0-dfdf41c0b227/mbid-cc525d5e-b4a5-40c7-9aa0-dfdf41c0b227-26369661688_thumb250.jpg",
            "spine": ""
        }
    ]
